doors-factory/ssl/Documents/ЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаказПокупателя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Заказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПереченьТоваров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

doors-factory/ssl/InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

doors-factory/ssl/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

doors-factory/ssl/Documents/Оплата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Оплата</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастичныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

doors-factory/ssl/Documents/ПланПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланПроизводства</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДвериКПроизводству</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

doors-factory/ssl/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) 
    // Получаем текущую дату без времени (начало дня)
    ТекДата = НачалоДня(ТекущаяДата());          
    
    // Перебираем каждую строку товаров из перечня текущего объекта
    Для Каждого СтрокаТовара Из ТекущийОбъект.ПереченьТоваров Цикл
        // Создаем набор записей для регистра "ЦеныТоваров"
        НаборЗаписей = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();
        // Устанавливаем отбор по текущей дате
        НаборЗаписей.Отбор.Период.Установить(ТекДата);
        // Устанавливаем отбор по названию товара
        НаборЗаписей.Отбор.Товар.Установить(СтрокаТовара.Название);
        // Читаем записи из регистра
        НаборЗаписей.Прочитать();
        
        // Флаг, указывающий на наличие изменений
        ЕстьИзменения = Ложь;
        // Проверяем, есть ли записи для данного товара
        Если НаборЗаписей.Количество() = 0 Тогда
            // Если записей нет, добавляем новую запись
            Запись = НаборЗаписей.Добавить();
            Запись.Период = ТекДата;     
            Запись.Товар = СтрокаТовара.Название;
            Запись.Цена = СтрокаТовара.Цена;  
            
            // Устанавливаем флаг изменения
            ЕстьИзменения = Истина;
        Иначе
            // Если записи есть, получаем первую запись
            Запись = НаборЗаписей.Получить(0);
            // Сравниваем цену из регистра с ценой в строке товара
            Если Запись.Цена <> СтрокаТовара.Цена Тогда
                ЕстьИзменения = Истина; // Устанавливаем флаг изменения
                Запись.Цена = СтрокаТовара.Цена; // Обновляем цену
            КонецЕсли;
        КонецЕсли;
        
        // Если были изменения, записываем их в регистр
        Если ЕстьИзменения Тогда
            НаборЗаписей.Записать();
        КонецЕсли;
    КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)  
    // Перебираем каждую строку товаров из перечня текущего объекта
    Для Каждого СтрокаТовара Из ТекущийОбъект.ПереченьТоваров Цикл
        // Создаем новый запрос для получения цены товара
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |	ЕСТЬNULL(ЦеныТоваровСрезПоследних.Цена, 0) КАК Цена
        |ИЗ
        |	РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
        |ГДЕ
        |	ЦеныТоваровСрезПоследних.Товар = &Товар"; // Условие для получения цены товара
        
        // Устанавливаем параметр "Товар" для запроса
        Запрос.УстановитьПараметр("Товар", СтрокаТовара.Название);
        
        // Выполняем запрос и получаем результат
        РезультатЗапроса = Запрос.Выполнить();
        // Проверяем, есть ли данные в результате запроса
        Если НЕ РезультатЗапроса.Пустой() Тогда
            // Если данные есть, выбираем их
            Выборка = РезультатЗапроса.Выбрать();
            Выборка.Следующий(); // Переходим к первой записи
            // Обновляем цену товара в строке
            СтрокаТовара.Цена = Выборка.Цена;  
        КонецЕсли;  
    КонецЦикла; 
    
КонецПроцедуры

&НаКлиенте
Процедура Оплатить(Команда)	
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму оплаты с блокировкой окна владельца
		ОткрытьФорму("Документ.Оплата.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнение(Команда)  
	// Флаг, указывающий на то, был ли документ записан
	ДокументЗаписан = Ложь;	

	// Проверяем, пустая ли ссылка на объект (документ)
	Если Объект.Ссылка.Пустая() Тогда
		// Если ссылка пустая, создаем новый документ в режиме проведения
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);   
	Иначе 
		// Если ссылка не пустая, документ уже существует, устанавливаем флаг в истину
		ДокументЗаписан = Истина;
	КонецЕсли;
	
	// Если документ успешно записан
	Если ДокументЗаписан Тогда
		// Подготавливаем параметры для открытия формы
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		// Открываем форму плана производства с блокировкой окна владельца
		ОткрытьФорму("Документ.ПланПроизводства.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры           

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	// Проверяем, пустой ли статус объекта
	Если Объект.Статус.Пустая() Тогда
		// Если статус пустой, устанавливаем его в "Новый"
		Объект.Статус = Перечисления.СтатусыЗаказов.Новый;
	КонецЕсли;               
	
КонецПроцедуры      

&НаКлиенте
Процедура ПереченьТоваровНазваниеПриИзменении(Элемент) 
	
	// Получить текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПереченьТоваров.ТекущиеДанные;
	// Устанавливаем цену для текущей строки табличной части
	СтрокаТабличнойЧасти.Цена = АвтоЦена.АктуальнаяЦенаТоваров( 
		Объект.Дата, СтрокаТабличнойЧасти.Название);    
	// Устанавливаем количество товара равным 1
	СтрокаТабличнойЧасти.Количество = 1;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровЦенаПриИзменении(Элемент)
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПереченьТоваров.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереченьТоваровКоличествоПриИзменении(Элемент)  
	
	// Получаем текущую строку табличной части "ПереченьТоваров"
	СтрокаТабличнойЧасти = Элементы.ПереченьТоваров.ТекущиеДанные;
	// Пересчитываем сумму строки в табличной части
	РасчетСтоимости.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры
